sist/oldSist/SiSTUDDI/xml/sb.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <save_business xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="urn:uddi-org:api_v2" generic="2.0">
      <authInfo>db2admin</authInfo>
      <businessEntity businessKey="">
        <name>Empresa ABC</name>
      </businessEntity>
    </save_business>
  </s:Body>
</s:Envelope>